>## Create a DataFrame

In [25]:
import pandas as pd
from Class.Accounting import Accounting
from Class.Programming import Programming
from Class.Sale import Sale

>Create Employees
>Class Accounting
- Name
- Salary
- Age

> Class Programmer
- Name
- Salary
- Experience
- Skill

> Class Sale
- Name
- Salary
- Area

>> Salary min = 1200, max = 5000

In [26]:
accounting = Accounting('Employee1', 2000, 20)
programmer = Programming('Employee2', 10000, 1, 'GameDev')
sale1 = Sale('Employee3', 1500,'Chiang Mai')
sale2 = Sale('Employee4', 1000,'Chiang Rai')

># Create DataFrame
> GetData Attributes

In [27]:
accounting.getData()

{'Name': 'Employee1',
 'Salary': 2000,
 'Department': 'Accounting',
 'Annual Income': 24000,
 'Age': 20}

> Series

In [28]:
ds_sale1 = pd.Series(sale1.getData())

#- For example: sale2 series format
ds_sale1

Name              Employee3
Salary                 1500
Department             Sale
Annual Income         18000
Area             Chiang Mai
dtype: object

> Create DataFrame from Series

In [29]:
ls_series = [accounting.getData(), programmer.getData(), sale1.getData(), sale2.getData()]
df = pd.DataFrame(ls_series)
df.set_index('Name', inplace = True)
df

,Salary,Department,Annual Income,Age,Experiment,Skill,Area
Name,,,,,,,
Employee1,2000,Accounting,24000,20.0,NaN,NaN,NaN
Employee2,5000,Programming,60000,NaN,1.0,GameDev,NaN
Employee3,1500,Sale,18000,NaN,NaN,NaN,Chiang Mai
Employee4,1200,Sale,14400,NaN,NaN,NaN,Chiang Rai

># TO CSV file&Exel file

In [30]:
df.to_csv('./Data/EmployeeDetails.csv')
df.to_excel('./Data/EmployeeDetailsTable.xlsx')